/* ДЗ 5 Конвертер

Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

кілометри - в метри
години - в хвилини
кілограми - в грами
Зробити вивід отриманої інформації у вигляді - "10 км це 10000 м" або "1 год це 60хв", або "1 кг це 1000 г". 

Умови виконання ДЗ:

В задачі не обовʼязково викорисутовувати prompt, просто запишіть значення в зміні.
Обовʼязково при написанні завдання використовуйте switch
Продумати варінат, якщо буде введена якась інша одиниця виміру
Мудрувати та створювати валідацію не потрібно */

let measurementUnit = "кілометри"; // "години", "кілограми", "метри" (невалідна)
let quantity = 8;


switch (measurementUnit) {
  case "кілометри":
    console.log(`${quantity} км це ${quantity * 1000} м`);
    break;

  case "години":
    console.log(`${quantity} год це ${quantity * 60} хв`);
    break;

  case "кілограми":
    console.log(`${quantity} кг це ${quantity * 1000} г`);
   break;

  default:
    console.log(`Одиниця вимірювання "${measurementUnit}" невалідна`);
}
