/* ЗАДАЧА 1.
Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другому - дві, і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".

Якось так:

// виклик функції

drawTriangle(5, '*');

// результат роботи функції в консолі

*

**

***

****

*****

Умови виконання ДЗ:

Домашню роботу необхідно зробити двома способами
В задачі не потрібно використовувати prompt() або щось інше повязане з UI
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки */

// while
/* function drawTriangle(height, symbol) {
  let i = 1;
  let line = symbol;

  while (i <= height) {
    console.log(line); // поточний рядок -1й рядок - починається з 1 символу
    line += symbol; // збільшуємо кількість символів
    i++; // збільшуємо на 1-цю кількість рядків
  }
}
drawTriangle(5, '*'); // присвюємо кількість рядків - висоту і символ */

/* // for 
function drawTriangle(height, symbol) {
  let line = symbol;
  for (let i = 1; i <= height; i++, line += symbol) {
    console.log(line);
  }
} // 1-й рядок, поки змінна i менше, рівно висоті, цикл буде виконуватися. до кожного рядка додається символ і збільшується на 1-цю ітератор 

drawTriangle(5, '*'); */

/* ЗАДАЧА 2.
Написати функцію pow(x,y) яка буде приймати 2 числа, перше - це число яке ми будемо зводити у ступінь, друге - у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8, тобто два в кубі. 

Умови виконання ДЗ:

Не використовувати **
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки */

/* function pow(x, y) {
  let result = 1;
  for (let i = 0; i < y; i++) {
    result = result * x;
  }
  return result;
}
let result = pow(2,3);
console.log(result); */

