/* ДЗ 4 Скільки тобі років

Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років" (тобто "29 років" чи "4 роки").

Умови виконання ДЗ:

Рік отримувати через prompt()
Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
Не використовувати функції або інші матеріали, які ми не вивчали.
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки. */

/* let age = prompt("Скільки тобі років?", ""); 
age = +age // перетворюємо рядок в число
if (isNaN(age) || age < 0) {
  console.log("Введи число не менше нуля"); // isNaN - вказує, що значення, яке запишеться в змінну age - це не число. все, що не число - буде true
} else if (age % 100 >= 11 && age % 100 <= 14) {
  console.log(`Тобі ${age} років`);
} else if (age % 10 === 1) {
  console.log(`Тобі ${age} рік`);
} else if (age % 10 >= 2 && age % 10 <= 4) {
  console.log(`Тобі ${age} роки`);
} else {
  console.log(`Тобі ${age} років`);
} */